// Завдання2
// -створити масив та вивести його в консоль:
// - з 5 числових значень
// let numbers = [14,3,27,323,1];
// console.log(numbers);

// Завдання3
// - з 5 стічкових значень
// let str = ["oleg","nazar","igor","ivan","bogdan"];
// console.log(str);

// Завдання4
// - з 5 значень стрічкового, числового та булевого типу
// let mix = ["oleg","nazar",true,false,475];
// console.log(mix);

// Завдання 5
// -- Створити пустий масив.
// Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let index=[];
// index[5]=[true,18, "hi"];
// index[11]="ok10";
// index[2]=5;
// console.log(index);

// Завдання 7
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i=0; i<10; i++ ){
//     document.write("<div> ok10 </div>")
// };

// Завдання 8
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i=1; i<=10; i++ ){
//     document.write(`<h1> ok${i} </h1>`)
//     document.write("<h1> ok"+ i + "</h1>")
// };
//
// Завдання 9
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let index=1;
// while (index<=20) {
//     document.write("<h1> Text </h1>")
//     index++;
// };

// Завдання 10
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let index=1;
// while (index<=20) {
//     document.write(`<h1> Text ${index} </h1>`)
//     index++;
// };

// Завдання 11
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let numbers=[2,64,98,143,8,458,96,-13,724,10];
// for (let i=0; i<10;i++){
//     console.log(numbers[i]);
// }

// Завдання 12
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let str=["maks", "vitaliy","tania","mark","lidia","oleksandr","volodymyr","ivan","lilia","natalia"];
// for (i=0;i<10;i++){
//     console.log(str[i]);
// }

// Завдання 13
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let mix=[12,true,"true",0,15,"robert",false,"false",-18,111];
// for (i=0;i<10;i++){
//     console.log(mix[i]);
// }

// Завдання 14
// - Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки булеві елементи
// let mix=[12,true,"true",0,15,"robert",false,"ok10",-18,111];
// for (let i=0;i<mix.length;i++){
//     if (typeof mix[i] == "boolean")
//     {console.log(mix[i])
//     }
// }

// Завдання 15
// - Створити масив з 10 елементів числового, стрічкового і булевого типу.
//     За допомогою if та typeof вивести тільки рядкові елементи
// let mix=[12,true,"true",0,15,"robert",false,"ok10",-18,111];
// for (let i=0; i<=mix.length; i++){
//     if (typeof mix[i]==="string"){
//         console.log(mix[i])
//     }
// }

// Завдання 16
// Створити масив з 10 елементів числового, стірчкового і булевого типу.
//     За допомогою if та typeof вивести тільки числові елементи
// let mix=[12,true,"true",0,15,"robert",false,"ok10",-18,111];
// for (let i=1; i<=mix.length;i++){
//     if (typeof mix[i]==="number"){
//         console.log(mix[i])
//     }
// }

// Завдання 17
// Створити порожній масив.
// Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
// let index=[];
// index[2]=5;
// index[3]=111;
// index[4]="oleg";
// index[5]=[true,18, "hi"];
// index[6]=false;
// index[7]=-1;
// index[8]="ivan";
// index[9]="bogdan";
// index[10]="ok10";
// index[35]=0;
// for (let i=0; i<index.length;i++){
//     console.log(index[i]);
// }

// Завдання 18
// Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// for (let i=1;i<=10;i++){
//     console.log(i);
//     document.write(`${i}`);
// }

// Завдання 19
// - Створити цикл for на 100 ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// for (let i=1; i<101;i++){
//     console.log(i);
//     document.write(`${i}<br>`);
// }

// Завдання 20
// - Створити цикл for на 100 ітерацій з кроком 2.
// Вивести поточний номер кроку через console.log та document.write
// for (let i=2;i<201;i=i+2){
//     console.log(i);
//     document.write(`${i}<br>`);
// }

// Завдання 21
// Створити цикл for на 100 ітерацій.
// Вивести тільки парні кроки. через console.log + document.write
// for (let i=0;i<100;i++){
//     if (i%2 === 0) {
//     console.log(i);
//     document.write(`${i}<br>`);}
// }

// Завдання 23
// Створити цикл for на 100 ітерацій.
// Вивести тільки непарні кроки. через console.log + document.write
// for (let i=0;i<100;i++){
//     if (i%2===1){
//         console.log(i);
//         document.write(`${i}<br>`);
//     }
// }

// Завдання 24
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// for (let i=0;i<2;i++){
//     for (let j=0;j<60;j++){
//         console.log(i,j);
//     }
// }

// Завдання 25
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// for (let i = 0; i < 3; i++) {
//      for(let j = 0; j< 60; j++) {
//          for(let k=0; k<60; k++) {
//              console.log('H '+ i +' M '+ j + ' S '+ k)
//              if(i === 2 && j === 20) {
//                  break;
//              }
//          }
//      }
// }
//
// for (let h = 0; h < 24; h++) {
//     for (let m = 0; m <= 59; m++) {
//         for (let s = 0; s < 60; s++) {
//             let clock =`${h}:${m}:${s}` ;
//             console.log(clock);
//             if (h === 2 && m ===20 )  {
//                 // m=60
//                 // h=24
//                 break;
//             }
//         }
//     }
// }

// ДОДАТКОВО:

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let mass=["a","b","c"];
// let str="";
// for (let i=0;i<mass.length;i++){
//    str=str+mass[i];
// }
// console.log(str);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// let mass=["a","b","c"];
// let str="";
// let i=0;
// while (i<mass.length){
//     str=str+mass[i]
//     i++;
// }
// console.log(str);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let mass=["a","b","c"];
// let str="";
// for (const x  of mass) {
//     str=str+x;
// }
// console.log(str);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.
// let mass=["a","b","c"];
// let str="";
// for (const x in mass){
//     str=str+mass[x];
// }
// console.log(str);

// Завдання 37
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу
// let arr=['a', 'b', 'c'];
// for (let i = 1; i < 4; i++) {
//     arr.push(i);
// }
// console.log(arr);

// Завдання 38
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let arr=[1, 2, 3];
// // console.log(arr.reverse());
//
// for (let i = 3; i >= arr.length; i--) {
//     const arrElement = arr[i];
// }
// console.log(arr);


// Завдання 39
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let arr=[1, 2, 3];
// arr.push(4,5,6)
// console.log(arr);

// Завдання 40
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let arr=[1, 2, 3];
// arr.unshift(4,5,6);
// console.log(arr);

// Завдання 41
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// let arr=['js', 'css', 'jq'];
// let first=arr.shift();
// console.log(first);

// Завдання 42
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let arr=['js', 'css', 'jq'];
// let third=arr.pop();
// console.log(third);

// Завдання 43
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// let arr=[1, 2, 3, 4, 5];
// arr=arr.slice(3,5);
// console.log(arr);

// Завдання 44
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// let arr=[1, 2, 3, 4, 5];
// console.log(arr = arr.slice(0, 2));

// Завдання 45
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// let arr=[1, 2, 3, 4, 5];
// let arr2=arr.splice(1,2);
// console.log(arr);

// Завдання 46
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr=[1, 2, 3, 4, 5];
// let arr2=arr.splice(2,0,"a","b","c");
// console.log(arr);

// Завдання 47
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr=[1, 2, 3, 4, 5];
// arr2=arr.splice(0,0,"a","b");
// console.log(arr);
// arr2=arr.splice(6,0,"c");
// console.log(arr);
// arr2=arr.splice(8,0,"e");
// console.log(arr);

// Завдання 48
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними
// let arr=[124,32,13,0,5,457,23,2,5,10];
// for (let i=0;i<arr.length;i++){
//     if (arr[i]%2===0){
//         console.log(arr[i]);
//     }
// }

// Завдання 49
// - Взяти масив з 10 чисел або створити його.
// Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr=[124,32,13,0,5,457,23,2,5,10];
// let arr2=[];
// for (let i = 0; i < arr.length; i++) {
//    arr2.push(arr[i]);
// }
// console.log(arr2);

// Завдання 50
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let arr=[124,32,13,0,5,457,23,2,5,10];
// let arr2=[];
// for (let i = 0; i < arr.length; i++) {
//    arr2[i]=arr[i];
// }
// console.log(arr2);


// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//  1. перебрати його циклом while
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while (i<arr.length){
//     console.log(arr[i])
//     i++;
// }

// 2. перебрати його циклом for
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){
//     console.log(arr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// i=0;
// while (i<arr.length){
//     if (i%2===1){
//         console.log(arr[i]);
//     }
//     i++;
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++){
//     if (i%2===1){
//         console.log(arr[i])
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while (i<arr.length){
//     if (arr[i]%2===0){
//         console.log(arr[i]);
//     }
//     i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=0; i<arr.length;i++){
//     if (arr[i]%2===0){
//         console.log(arr[i]);
//     }
// }

// 7. замінити кожне число кратне 3 на слово "ok10"
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i]%3===0){
//     arr[i]="ok10";
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// arr.reverse();
// console.log(arr);

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 9.1. перебрати його циклом while в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// let i=arr.length-1;
// while (i>=0){
//     console.log(arr[i]);
//     i--;
// }

// 9.2. перебрати його циклом for в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=arr.length-1; i>=0; i--) {
//     console.log(arr[i]);
// }

// 9.3. перебрати циклом while та вивести  числа тільки з непарним індексом в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// let i=arr.length-1;
// while (i>=0){
//     if (i%2===1){
//         console.log(arr[i]);
//     }
//     i--;
// }

// 9.4. перебрати циклом for та вивести  числа тільки з непарним індексом в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=arr.length-1; i>=0; i--) {
//    if (i%2===1){
//        console.log(arr[i]);
//    }
// }

// 9.5. перебрати циклом while та вивести  числа тільки парні  значення в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// let i=arr.length-1;
// while (i>=0){
//     if (arr[i]%2===0){
//         console.log(arr[i]);
//     }
//     i--;
// }

// 9.6. перебрати циклом for та вивести  числа тільки парні  значення в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=arr.length-1; i>=0; i--) {
//    if (arr[i]%2===0){
//        console.log(arr[i]);
//    }
// }

// 9.7. замінити кожне число кратне 3 на слово "ok10" в зворотньому циклі (с заду на перед)
// let arr=[2,17,13,6,22,31,45,66,100,-18];
// for (let i=arr.length-1; i>=0; i--) {
//    if (arr[i]%3===0){
//        arr[i]="ok10";
//    }
// }
// console.log(arr.reverse());

// 10 -створити пустий масив та :
//
// 10.1 - заповнити його 50 парними числами за допомоги циклу.
// let arr=[];
// for (let i = 1; i <= 50; i++) {
//     if (i%2===0){
//         arr[i]=i;
//     }
// }
// console.log(arr);

// -----------------------------------------------------------

// let arr=[];
// for (let i = 0; i <50; i++) {
//     arr[i]=i*2;
// }
// console.log(arr);

// 10.2 - заповнити його 50 непарними числами за допомоги циклу.
// let arr=[];
// for (let i = 0; i <50; i++) {
//     arr[i]=i*2+1;
// }
// console.log(arr);


// створити пустий масив та :
// 1. используя Math.random заполнить массив из ???(сколько хотите) элементов.
// Диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// let arr=[];
// for (let i = 0; i < 20; i++) {
//     arr[i]=Math.round(Math.random()*(732-8)+8);
// }
// console.log(arr);

// 2. вывести на консоль  каждый третий елемент
// let arr=[];
// for (let i = 0; i < 20; i++) {
//     arr[i]=Math.round(Math.random()*(732-8)+8);
// }
// console.log(arr);
// for (let i = 2; i < arr.length; i=i+3) {
//        console.log(arr[i]);
// }

// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.\
// let arr=[];
// for (let i = 0; i < 20; i++) {
//     arr[i]=Math.round(Math.random()*(732-8)+8);
// }
// console.log(arr);
// for (let i = 2; i < arr.length; i=i+3) {
//     if (arr[i]%2===0)
//         console.log(arr[i]);
// }

// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// let arr=[];
// for (let i = 0; i < 20; i++) {
//     arr[i]=Math.round(Math.random()*(732-8)+8);
// }
// console.log(arr);
// let arr2=[];
// for (let i = 2; i < arr.length; i=i+3) {
//     if (arr[i]%2===0)
//     arr2.push(arr[i]);
// }
// console.log(arr2);


// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// let arr=[];
// for (let i = 0; i < 20; i++) {
//     arr[i]=Math.round(Math.random()*(732-8)+8);
// }
// console.log(arr);
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i+1]%2===0){
//         console.log(arr[i]);
//     }
// }

// 6. масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// let arr=[100,250,50,168,120,345,188];
// let sum = 0;
// for (let i=0;i<arr.length;i++){
//     sum = sum + arr[i];  // sum += arr[i];
// }
// const sa = sum / arr.length;
// console.log(sa);

// 7. створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let arr=[];
// let arr2=[];
// for (let i=0; i<20; i++) {
//     arr[i]=Math.round(Math.random()*(100-9)+9)
// }
// for(let i=0; i<arr.length; i++) {
//     const value = arr[i] * 5;
//     arr2.push(value)
// }
// console.log(arr)
// console.log(arr2);

// 8. створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо обєкт є числом,
// додати його в інший масив
// let arr=[13,"ok10",true,325,-124,"bogdan",false,76,"nazar"];
// let arr2=[];
// for (let i=0;i<arr.length;i++){
//     if (typeof arr[i] === "number"){
//         arr2.push(arr[i]);
//     }
// }
// console.log(arr);
// console.log(arr2);



