// Завдання1
//- створити функцію яка виводить масив
//
//
//
//
//
//
//
//
//
//// Завдання2
//- створити функцію яка заповнює масив рандомними числами та виводить його.
// Для виведення використати попвередню функцію.
// function create(length,min,max){
//     let arr=[];
//     for (let i = 0; i < length; i++) {
//     arr.push(Math.round(Math.random()*(max-min)+min))
//     }
//     return arr();
//
// }
// let arr1=create(30,5,20);
// array(arr1);



// Завдання3
// - створити функцію яка приймає три числа та виводить та повертає найменьше.


// Завдання4
// - створити функцію яка приймає три числа та виводить та повертає найбільше.


// Завдання5
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

// Завдання6
// - створити функцію яка виводить масив

// Завдання7
// - створити функцію яка повертає найбільше число з масиву

// Завдання8
// - створити функцію яка повертає найменьше число з масиву

// Завдання9
// - створити функцію яка приймає масив чисел та складає значення елементів масиву та повертає його.

// Завдання10
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// Завдання11
// - Створити функцію яка приймає масив будь яких объектів, та повертає значення кількості обєктів в масиві

// Завдання12
// - Створити функцію яка приймає масив будь яких объектів, та повертає загальн кількість полів в них

// Завдання13
// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
// Приклад
//     [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]